espruino/Espruino/targetlibs/nrf5x/nrf5_sdk/components/experimental_nfc/t2t_lib/hal_t2t/hal_nfc_t2t.c
#ifdef HAL_NFC_ENGINEERING_A_FTPAN_WORKAROUND
/* Begin: Bugfix for FTPAN-45 (IC-6915) */
volatile uint8_t m_nfc_active = 0;
/* End: Bugfix for FTPAN-45  (IC-6915) */

/* Begin: Bugfix for FTPAN-17 (IC-9563) */
/* The following three function definitions are a workaround for IC-9563: NFC in nRF52 IC rev. Engineering A does not
 * give the field lost signal when field is turned off. */
static void hal_nfc_field_check(void);
 
static   bool field_on              = false;
volatile bool hal_nfc_fielddetected = false;
volatile bool hal_nfc_fieldlost     = false;

static void field_timer_with_callback_config()
{
    NRF_TIMER4->MODE      = TIMER_MODE_MODE_Timer << TIMER_MODE_MODE_Pos;
    NRF_TIMER4->BITMODE   = TIMER_BITMODE_BITMODE_08Bit << TIMER_BITMODE_BITMODE_Pos;
    NRF_TIMER4->PRESCALER = 4 << TIMER_PRESCALER_PRESCALER_Pos;
    NRF_TIMER4->CC[0]     = 100 << TIMER_CC_CC_Pos;
    NRF_TIMER4->SHORTS    = TIMER_SHORTS_COMPARE0_CLEAR_Enabled << TIMER_SHORTS_COMPARE0_CLEAR_Pos;
    NRF_TIMER4->INTENSET  = TIMER_INTENSET_COMPARE0_Set << TIMER_INTENSET_COMPARE0_Pos;

    NVIC_ClearPendingIRQ(TIMER4_IRQn);
    NVIC_SetPriority(TIMER4_IRQn, APP_IRQ_PRIORITY_LOW);
    NVIC_EnableIRQ(TIMER4_IRQn);
}

void TIMER4_IRQHandler(void)
{
    hal_nfc_field_check();
    NRF_TIMER4->EVENTS_COMPARE[0] = 0;
}

static void hal_nfc_field_check(void)
{
    static uint32_t   field_state_cnt = 0;
    volatile uint32_t dummy;    
    uint32_t          nfc_fieldpresen_masked;

    /* Begin: Bugfix for FTPAN-24 */
    NRF_NFCT_AUTOCOLRESSTATUS = 0; /* dummy write - no effect. */
    NRF_NFCT_AUTOCOLRESSTATUS = 0; /* dummy write - no effect. */
    // Don't worry about interrupted case - NRF_NFCT->FIELDPRESENT is read each 100 us, so the workaround should succeed most of the times.
    /* End: Bugfix for FTPAN-24 */

    nfc_fieldpresen_masked = NRF_NFCT->FIELDPRESENT & NFC_HAL_FIELDPRESENT_MASK;

    if (field_on)
    {
        if (nfc_fieldpresen_masked == NFC_HAL_FIELDPRESENT_IS_LOST)
        {
            ++field_state_cnt;
            if (field_state_cnt > 7)
            {
                field_state_cnt   = 0;
                hal_nfc_fieldlost = true;
                dummy             = hal_nfc_fieldlost;
                field_on          = false;
                NVIC_SetPendingIRQ(NFCT_IRQn);
                UNUSED_VARIABLE(dummy);
            }
            
            return;
        }
    }
    else
    {     
        nfc_fieldpresen_masked &= NFCT_FIELDPRESENT_FIELDPRESENT_Msk;
        if (nfc_fieldpresen_masked !=  NFC_HAL_FIELDPRESENT_NO_FIELD)
        {
            ++field_state_cnt;
            if (field_state_cnt > 7)
            {
                field_state_cnt       = 0;
                hal_nfc_fielddetected = true;
                dummy                 = hal_nfc_fielddetected;
                field_on              = true;
                NVIC_SetPendingIRQ(NFCT_IRQn);
                UNUSED_VARIABLE(dummy);
            }
            
            return;
        }
    }

    field_state_cnt = 0;
}
/* End: Bugfix for FTPAN-17, FTPAN-27 */
#endif // HAL_NFC_ENGINEERING_A_FTPAN_WORKAROUND

hal_nfc_retval hal_nfc_setup(hal_nfc_callback callback, void *cbContext)
{
    uint32_t nfc_tag_header0                     = NRF_FICR->NFC.TAGHEADER0;
    uint32_t nfc_tag_header1                     = NRF_FICR->NFC.TAGHEADER1;
    uint8_t  nfc_internal[T2T_INTERNAL_BYTES_NR] = {0};                         // Buffer for internal bytes used in NFC message header

    m_nfc_lib_callback = callback;
    m_nfc_lib_context  = cbContext;

/* Begin: Bugfix for FTPAN-17 */
/* fixed by avoiding usage of FIELDLOST and FIELDETECTED events */
#ifndef  HAL_NFC_ENGINEERING_A_FTPAN_WORKAROUND

    NRF_NFCT->INTENSET = (NFCT_INTENSET_FIELDDETECTED_Enabled << NFCT_INTENSET_FIELDDETECTED_Pos) |
                         (NFCT_INTENSET_FIELDLOST_Enabled     << NFCT_INTENSET_FIELDLOST_Pos);

#endif // HAL_NFC_ENGINEERING_A_FTPAN_WORKAROUND
/* End: Bugfix for FTPAN-17 */

    NRF_NFCT->INTENSET = (NFCT_INTENSET_ERROR_Enabled    << NFCT_INTENSET_ERROR_Pos) |
                         (NFCT_INTENSET_SELECTED_Enabled << NFCT_INTENSET_SELECTED_Pos);

#ifdef  HAL_NFC_ENGINEERING_A_FTPAN_WORKAROUND
    /* Begin:   Bugfix for FTPAN-45 (IC-6915) */
    NRF_NFCT->INTENSET = (NFCT_INTENSET_RXFRAMESTART_Enabled << NFCT_INTENSET_RXFRAMESTART_Pos) |
                         (NFCT_INTENSET_TXFRAMESTART_Enabled << NFCT_INTENSET_TXFRAMESTART_Pos);
    /* End:   Bugfix for FTPAN-45 (IC-6915) */
#endif // HAL_NFC_ENGINEERING_A_FTPAN_WORKAROUND

    /* According to ISO/IEC 14443-3 */
    nfc_internal[0] = (uint8_t) (LSB(nfc_tag_header0 >> T2T_INTERNAL_BYTE_SN0_SHIFT));         //SN0
    nfc_internal[1] = (uint8_t) (LSB(nfc_tag_header0 >> T2T_INTERNAL_BYTE_SN1_SHIFT));         //SN1
    nfc_internal[2] = (uint8_t) (LSB(nfc_tag_header0 >> T2T_INTERNAL_BYTE_SN2_SHIFT));         //SN2
    nfc_internal[3] = (uint8_t) ((CASCADE_TAG_BYTE) ^ nfc_internal[0] ^ 
                                  nfc_internal[1]   ^ nfc_internal[2]);                        //BCC0 = CASCADE_TAG_BYTE ^ SN0 ^ SN1 ^ SN2
    nfc_internal[4] = (uint8_t) (LSB(nfc_tag_header1 >> T2T_INTERNAL_BYTE_SN3_SHIFT));         //SN3
    nfc_internal[5] = (uint8_t) (LSB(nfc_tag_header1 >> T2T_INTERNAL_BYTE_SN4_SHIFT));         //SN4
    nfc_internal[6] = (uint8_t) (LSB(nfc_tag_header1 >> T2T_INTERNAL_BYTE_SN5_SHIFT));         //SN5
    nfc_internal[7] = (uint8_t) (LSB(nfc_tag_header1 >> T2T_INTERNAL_BYTE_SN6_SHIFT));         //SN6
    nfc_internal[8] = (uint8_t) (nfc_internal[4] ^ nfc_internal[5] ^
                                 nfc_internal[6] ^ nfc_internal[7]);                           //BCC1 = SN3 ^ SN4 ^ SN5 ^ SN6
    nfc_internal[9] = (uint8_t) (NFC_LIB_VERSION);                                             //For internal use

    (void) nfcSetInternal((char *) nfc_internal, sizeof(nfc_internal));

    /* MSB of NFCID1_2ND_LAST register is not used - always 0 */
    NRF_NFCT->NFCID1_2ND_LAST = ((uint32_t) nfc_internal[0] << NFCID1_2ND_LAST_BYTE2_SHIFT) |
                                ((uint32_t) nfc_internal[1] << NFCID1_2ND_LAST_BYTE1_SHIFT) |
                                ((uint32_t) nfc_internal[2] << NFCID1_2ND_LAST_BYTE0_SHIFT);

    NRF_NFCT->NFCID1_LAST = ((uint32_t) nfc_internal[4] << NFCID1_LAST_BYTE3_SHIFT) |
                            ((uint32_t) nfc_internal[5] << NFCID1_LAST_BYTE2_SHIFT) |
                            ((uint32_t) nfc_internal[6] << NFCID1_LAST_BYTE1_SHIFT) |
                            ((uint32_t) nfc_internal[7] << NFCID1_LAST_BYTE0_SHIFT);

    /* Begin: Bugfix for FTPAN-25 (IC-9929) */
    /* Workaround for wrong SENSRES values require using SDD00001, but here SDD00100 is used
       because it's required to operate with Windows Phone */
    NRF_NFCT->SENSRES =
            (NFCT_SENSRES_NFCIDSIZE_NFCID1Double << NFCT_SENSRES_NFCIDSIZE_Pos) |
            (NFCT_SENSRES_BITFRAMESDD_SDD00100   << NFCT_SENSRES_BITFRAMESDD_Pos);
    /* End:   Bugfix for FTPAN-25 (IC-9929)*/

    /* Initialize SDK Clock module for handling high precission clock requests */
    m_clock_handler_item.event_handler = nrf_nfct_clock_event_handler;
    m_clock_handler_item.p_next        = NULL;

    ret_code_t err_code = nrf_drv_clock_init();
    
#ifdef  HAL_NFC_ENGINEERING_A_FTPAN_WORKAROUND    
    /* Begin: Bugfix for FTPAN-57 (IC-9563) */
    /* Values taken from IC-9563 */
    NRF_NFCT_SHUNTREGTHRESHOLDS = 0x00000005;
    NRF_NFCT_MODSTEPFIXED       = 0x0000003F;
    NRF_NFCT_MODSTEPMULTIPLIER  = 0x00000001;
    NRF_NFCT_INITIALLOADCTRLVAL = 0x00000001;
    /* End: Bugfix for FTPAN-57  (IC-9563) */

    /* Begin: Bugfix for FTPAN-17 (IC-9563) */
    /* Activating workaround. */
    field_timer_with_callback_config();
    NRF_TIMER4->TASKS_START = 1;
    /* End:   Bugfix for FTPAN-17 (IC-9563) */
#endif // HAL_NFC_ENGINEERING_A_FTPAN_WORKAROUND

    LOG_HAL_NFC("[NFC_HAL]: initialize\r\n");

    if ((err_code == NRF_SUCCESS) || (err_code == MODULE_ALREADY_INITIALIZED))
    {
        return HAL_NFC_RETVAL_OK;
    }
    else
    {
        return HAL_NFC_RETVAL_ERROR;
    }
}

/**@brief Function for clearing an event flag in NRF_NFCT registers.
 *
 * @param[in]  p_event  Pointer to event register.
 *
 */
static inline void nrf_nfct_event_clear(volatile uint32_t * p_event)
{
    *p_event = 0;

    /* Perform read to ensure clearing is effective */
    volatile uint32_t dummy = *p_event;
    (void)dummy;
}

/**@brief Function for handling events from Clock Module.
 *
 * @param[in]  event  Clock event.
 *
 */
static inline void nrf_nfct_clock_event_handler(nrf_drv_clock_evt_type_t event)
{
    switch(event)
    {
        case NRF_DRV_CLOCK_EVT_HFCLK_STARTED:
            /* Activate NFCT only when HFXO is running */
            NRF_NFCT->TASKS_ACTIVATE = 1;
            break;

        default:
            /* No implementation required */
            break;
    }
}

/**@brief Function for evaluating and handling NFC field events.
 *
 * @param[in]  field_state  Current field state.
 *
 */
static inline void nrf_nfct_field_event_handler(volatile nfct_field_sense_state_t field_state)
{
    if (field_state == NFC_FIELD_STATE_UNKNOWN)
    {
        /* Probe NFC field */
        uint32_t field_present = NRF_NFCT->FIELDPRESENT;

        if (field_present & m_nfc_fieldpresent_mask)
        {
            field_state = NFC_FIELD_STATE_ON;
        }
        else
        {
            field_state = NFC_FIELD_STATE_OFF;
        }
    }

    /* Field event service */
    switch(field_state)
    {
        case NFC_FIELD_STATE_ON:
            if (!m_field_on)
            {
                nrf_drv_clock_hfclk_request(&m_clock_handler_item);
            }
            m_field_on = true;
            break;

        case NFC_FIELD_STATE_OFF:
            nrf_drv_clock_hfclk_release();

