espruino/Espruino/targetlibs/nrf5x/nrf5_sdk/components/experimental_nfc/t2t_lib/hal_t2t/hal_nfc_t2t.c
            NRF_NFCT->TASKS_SENSE = 1;
            m_field_on = false;

            NRF_NFCT->INTENCLR = 
                (NFCT_INTENCLR_RXFRAMEEND_Clear << NFCT_INTENCLR_RXFRAMEEND_Pos) |
                (NFCT_INTENCLR_RXERROR_Clear    << NFCT_INTENCLR_RXERROR_Pos);

            /* Change mask to FIELD_OFF state - trigger FIELD_ON even if HW has not locked to the field */
            m_nfc_fieldpresent_mask = NFC_FIELD_OFF_MASK;

            if ((m_nfc_lib_callback != NULL) )
            {
                m_nfc_lib_callback(m_nfc_lib_context, HAL_NFC_EVENT_FIELD_OFF, 0, 0);
            }
            break;

        default:
            /* No implementation required */
            break;
    }
}

/* This function is used by nfc_lib for unit testing only */
hal_nfc_retval hal_nfc_set_parameter(hal_nfc_param_id id, void *data, size_t dataLength)
{
    (void)id;
    (void)data;
    (void)dataLength;

    return HAL_NFC_RETVAL_OK;
} 

/* This function is used by nfc_lib for unit testing only */
hal_nfc_retval hal_nfc_get_parameter(hal_nfc_param_id id, void *data, size_t *maxDataLength)
{
    (void)id;
    (void)data;
    (void)maxDataLength;

    return HAL_NFC_RETVAL_OK;
}


hal_nfc_retval hal_nfc_start(void)
{
    NRF_NFCT->ERRORSTATUS = NRF_NFCT_ERRORSTATUS_ALL;

    NVIC_ClearPendingIRQ(NFCT_IRQn);
    NVIC_SetPriority(NFCT_IRQn, APP_IRQ_PRIORITY_LOW);
    NVIC_EnableIRQ(NFCT_IRQn);

    NRF_NFCT->TASKS_SENSE = 1;

    LOG_HAL_NFC("[NFC_HAL]: start\r\n");
    
    return HAL_NFC_RETVAL_OK;
}

hal_nfc_retval hal_nfc_send(const char *data, size_t dataLength)
{
    if (dataLength == 0)
    {
        return HAL_NFC_RETVAL_INVALID_SIZE;
    }

    /* Ignore previous TX END events, SW takes care only for data frames which tranmission is triggered in this function */
    nrf_nfct_event_clear(&NRF_NFCT->EVENTS_TXFRAMEEND);

    NRF_NFCT->PACKETPTR     = (uint32_t) data;
    NRF_NFCT->TXD.AMOUNT    = (dataLength << NFCT_TXD_AMOUNT_TXDATABYTES_Pos) &
                               NFCT_TXD_AMOUNT_TXDATABYTES_Msk;
    NRF_NFCT->INTENSET      = (NFCT_INTENSET_TXFRAMEEND_Enabled << NFCT_INTENSET_TXFRAMEEND_Pos);
    NRF_NFCT->TASKS_STARTTX = 1;

    LOG_HAL_NFC("[NFC_HAL]: send\r\n");
    
    return HAL_NFC_RETVAL_OK;
}

hal_nfc_retval hal_nfc_stop(void)
{
    NRF_NFCT->TASKS_DISABLE = 1;

    LOG_HAL_NFC("[NFC_HAL]: stop\r\n");
    
    return HAL_NFC_RETVAL_OK;
}

hal_nfc_retval hal_nfc_done(void)
{
    m_nfc_lib_callback = (hal_nfc_callback) NULL;

    return HAL_NFC_RETVAL_OK;
}

void NFCT_IRQHandler(void)
{
    nfct_field_sense_state_t current_field = NFC_FIELD_STATE_NONE;

#ifdef  HAL_NFC_ENGINEERING_A_FTPAN_WORKAROUND
        /* Begin: Bugfix for FTPAN-27 */
    if (hal_nfc_fielddetected)
    {
        hal_nfc_fielddetected        = false;
        NRF_NFCT_TASKS_DISABLERXDATA = 1;
        /* End: Bugfix for FTPAN-27 */
#else
    if (NRF_NFCT->EVENTS_FIELDDETECTED && (NRF_NFCT->INTEN & NFCT_INTEN_FIELDDETECTED_Msk)) 
    {
        nrf_nfct_event_clear(&NRF_NFCT->EVENTS_FIELDDETECTED);
#endif

        current_field = NFC_FIELD_STATE_ON;

        LOG_HAL_NFC("[NFC_HAL]: fielddetected\r\n");
    }

#ifdef  HAL_NFC_ENGINEERING_A_FTPAN_WORKAROUND
    /* Begin: Bugfix for FTPAN-27 */
    if (hal_nfc_fieldlost)
    {
        hal_nfc_fieldlost = false;
        current_field     =
           (current_field == NFC_FIELD_STATE_NONE) ? NFC_FIELD_STATE_OFF : NFC_FIELD_STATE_UNKNOWN;

        NRF_NFCT->TASKS_SENSE = 1;

        LOG_HAL_NFC("[NFC_HAL]: fieldlost\r\n");
    }
    /* End: Bugfix for FTPAN-27 */
#else
    if (NRF_NFCT->EVENTS_FIELDLOST && (NRF_NFCT->INTEN & NFCT_INTEN_FIELDLOST_Msk))
    {
        nrf_nfct_event_clear(&NRF_NFCT->EVENTS_FIELDLOST);
        current_field =
           (current_field == NFC_FIELD_STATE_NONE) ? NFC_FIELD_STATE_OFF : NFC_FIELD_STATE_UNKNOWN;

        LOG_HAL_NFC("[NFC_HAL]: fieldlost\r\n");
    }
#endif

    /* Perform actions if any FIELD event is active */
    if (current_field != NFC_FIELD_STATE_NONE)
    {
       nrf_nfct_field_event_handler(current_field);
    }

    if (NRF_NFCT->EVENTS_RXFRAMEEND && (NRF_NFCT->INTEN & NFCT_INTEN_RXFRAMEEND_Msk))
    {
        /* Take into account only number of whole bytes */
        uint32_t rx_data_size = ((NRF_NFCT->RXD.AMOUNT & NFCT_RXD_AMOUNT_RXDATABYTES_Msk) >>
                                 NFCT_RXD_AMOUNT_RXDATABYTES_Pos) - NFC_CRC_SIZE;
        nrf_nfct_event_clear(&NRF_NFCT->EVENTS_RXFRAMEEND);

        /* Look for Tag 2 Type READ Command */
        if (m_nfc_rx_buffer[0] == T2T_READ_CMD)
        {
            if(m_nfc_lib_callback != NULL)
            {
                /* This callback should trigger transmission of READ Response */
                m_nfc_lib_callback(m_nfc_lib_context,
                                   HAL_NFC_EVENT_DATA_RECEIVED,
                                   (void*) m_nfc_rx_buffer,
                                   rx_data_size);
            }
        }
        else
        {
            /* Indicate that SLP_REQ was received - this will cause FRAMEDELAYTIMEOUT error */
            if(m_nfc_rx_buffer[0] == NFC_SLP_REQ_CMD)
            {
                m_slp_req_received = true;
            }
            /* Not a READ Command, so wait for next frame reception */
            NRF_NFCT->TASKS_ENABLERXDATA = 1;          
        }

#ifdef  HAL_NFC_ENGINEERING_A_FTPAN_WORKAROUND
        /* Begin:   Bugfix for FTPAN-45 (IC-6915) */
        m_nfc_active = 0;
        /* End:   Bugfix for FTPAN-45 (IC-69150) */
#endif
        LOG_HAL_NFC("[NFC_HAL]: rx_fend\r\n");
    }

    if (NRF_NFCT->EVENTS_TXFRAMEEND && (NRF_NFCT->INTEN & NFCT_INTEN_TXFRAMEEND_Msk))
    {
        nrf_nfct_event_clear(&NRF_NFCT->EVENTS_TXFRAMEEND);

        /* Disable TX END event to ignore frame transmission other than READ response */
        NRF_NFCT->INTENCLR = (NFCT_INTENCLR_TXFRAMEEND_Clear << NFCT_INTENCLR_TXFRAMEEND_Pos);

        /* Set up for reception */
        NRF_NFCT->PACKETPTR          = (uint32_t) m_nfc_rx_buffer;
        NRF_NFCT->MAXLEN             = NFC_RX_BUFFER_SIZE;
        NRF_NFCT->TASKS_ENABLERXDATA = 1;

        if (m_nfc_lib_callback != NULL)
        {
            m_nfc_lib_callback(m_nfc_lib_context, HAL_NFC_EVENT_DATA_TRANSMITTED, 0, 0);
        }

#ifdef  HAL_NFC_ENGINEERING_A_FTPAN_WORKAROUND
        /* Begin:   Bugfix for FTPAN-45 (IC-6915) */
        m_nfc_active = 0;
        /* End:   Bugfix for FTPAN-45 (IC-6915) */
#endif
        LOG_HAL_NFC("[NFC_HAL]: tx_fend\r\n");
    }

#ifdef  HAL_NFC_ENGINEERING_A_FTPAN_WORKAROUND
    /* Begin:   Bugfix for FTPAN-45 (IC-6915) */
    if (NRF_NFCT->EVENTS_RXFRAMESTART)
    {
        nrf_nfct_event_clear(&NRF_NFCT->EVENTS_RXFRAMESTART);

        if (m_nfc_active == 0)
        {
            m_nfc_active = 1;
        }
        LOG_HAL_NFC("[NFC_HAL]: rx_fstart\r\n");
    }
    if (NRF_NFCT->EVENTS_TXFRAMESTART)
    {
        nrf_nfct_event_clear(&NRF_NFCT->EVENTS_TXFRAMESTART);

        if (m_nfc_active == 0)
        {
            m_nfc_active = 1;
        }
        LOG_HAL_NFC("[NFC_HAL]: tx_fstart\r\n");
    }
    /* End:   Bugfix for FTPAN-45 (IC-6915) */
#endif

    if (NRF_NFCT->EVENTS_SELECTED && (NRF_NFCT->INTEN & NFCT_INTEN_SELECTED_Msk))
    {
        nrf_nfct_event_clear(&NRF_NFCT->EVENTS_SELECTED);
        /* Clear also RX END and RXERROR events because SW does not take care of commands which were received before selecting the tag */
        nrf_nfct_event_clear(&NRF_NFCT->EVENTS_RXFRAMEEND);
        nrf_nfct_event_clear(&NRF_NFCT->EVENTS_RXERROR);

        /* Set up registers for EasyDMA and start receiving packets */
        NRF_NFCT->PACKETPTR          = (uint32_t) m_nfc_rx_buffer;
        NRF_NFCT->MAXLEN             = NFC_RX_BUFFER_SIZE;
        NRF_NFCT->TASKS_ENABLERXDATA = 1;

        NRF_NFCT->INTENSET = (NFCT_INTENSET_RXFRAMEEND_Enabled << NFCT_INTENSET_RXFRAMEEND_Pos) |
                             (NFCT_INTENSET_RXERROR_Enabled    << NFCT_INTENSET_RXERROR_Pos);

